name: "surg_phase_ERFNet_decoder_exp1_pelee_sfmax_128x64_train"
layer {
  name: "data"
  type: "HDF5Data"
  top: "data"
  top: "label"
  hdf5_data_param {
    source: "/mnt/sda/train_h5_list.txt"
    batch_size: 150
    shuffle: true
  }
}
layer {
  name: "DownsamplerBlock1_conv"
  type: "Convolution"
  bottom: "data"
  top: "DownsamplerBlock1_conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 15
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "DownsamplerBlock1_pool"
  type: "Pooling"
  bottom: "data"
  top: "DownsamplerBlock1_pool"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "DownsamplerBlock1_concat"
  type: "Concat"
  bottom: "DownsamplerBlock1_conv"
  bottom: "DownsamplerBlock1_pool"
  top: "DownsamplerBlock1_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "DownsamplerBlock1_concat/bn"
  type: "BatchNorm"
  bottom: "DownsamplerBlock1_concat"
  top: "DownsamplerBlock1_concat"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "DownsamplerBlock1_concat/scale"
  type: "Scale"
  bottom: "DownsamplerBlock1_concat"
  top: "DownsamplerBlock1_concat"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "DownsamplerBlock1_concat/relu"
  type: "ReLU"
  bottom: "DownsamplerBlock1_concat"
  top: "DownsamplerBlock1_concat"
}
layer {
  name: "DownsamplerBlock2_conv"
  type: "Convolution"
  bottom: "DownsamplerBlock1_concat"
  top: "DownsamplerBlock2_conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 48
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "DownsamplerBlock2_pool"
  type: "Pooling"
  bottom: "DownsamplerBlock1_concat"
  top: "DownsamplerBlock2_pool"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "DownsamplerBlock2_concat"
  type: "Concat"
  bottom: "DownsamplerBlock2_conv"
  bottom: "DownsamplerBlock2_pool"
  top: "DownsamplerBlock2_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "DownsamplerBlock2_concat/bn"
  type: "BatchNorm"
  bottom: "DownsamplerBlock2_concat"
  top: "DownsamplerBlock2_concat"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "DownsamplerBlock2_concat/scale"
  type: "Scale"
  bottom: "DownsamplerBlock2_concat"
  top: "DownsamplerBlock2_concat"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "DownsamplerBlock2_concat/relu"
  type: "ReLU"
  bottom: "DownsamplerBlock2_concat"
  top: "DownsamplerBlock2_concat"
}
layer {
  name: "NBD3_conv1_3x1"
  type: "Convolution"
  bottom: "DownsamplerBlock2_concat"
  top: "NBD3_conv1_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD3_conv1_3x1/relu"
  type: "ReLU"
  bottom: "NBD3_conv1_3x1"
  top: "NBD3_conv1_3x1"
}
layer {
  name: "NBD3_conv1_1x3"
  type: "Convolution"
  bottom: "NBD3_conv1_3x1"
  top: "NBD3_conv1_1x3"
  convolution_param {
    num_output: 64
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD3_conv1_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD3_conv1_1x3"
  top: "NBD3_conv1_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD3_conv1_1x3/scale"
  type: "Scale"
  bottom: "NBD3_conv1_1x3"
  top: "NBD3_conv1_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD3_conv1_1x3/relu"
  type: "ReLU"
  bottom: "NBD3_conv1_1x3"
  top: "NBD3_conv1_1x3"
}
layer {
  name: "NBD3_conv2_3x1"
  type: "Convolution"
  bottom: "NBD3_conv1_1x3"
  top: "NBD3_conv2_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD3_conv2_3x1/relu"
  type: "ReLU"
  bottom: "NBD3_conv2_3x1"
  top: "NBD3_conv2_3x1"
}
layer {
  name: "NBD3_conv2_1x3"
  type: "Convolution"
  bottom: "NBD3_conv2_3x1"
  top: "NBD3_conv2_1x3"
  convolution_param {
    num_output: 64
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD3_conv2_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD3_conv2_1x3"
  top: "NBD3_conv2_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD3_conv2_1x3/scale"
  type: "Scale"
  bottom: "NBD3_conv2_1x3"
  top: "NBD3_conv2_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD3_conv2_1x3/relu"
  type: "ReLU"
  bottom: "NBD3_conv2_1x3"
  top: "NBD3_conv2_1x3"
}
layer {
  name: "NBD3_res"
  type: "Eltwise"
  bottom: "DownsamplerBlock2_concat"
  bottom: "NBD3_conv2_1x3"
  top: "NBD3_res"
}
layer {
  name: "NBD3_res/relu"
  type: "ReLU"
  bottom: "NBD3_res"
  top: "NBD3_res"
}
layer {
  name: "NBD4_conv1_3x1"
  type: "Convolution"
  bottom: "NBD3_res"
  top: "NBD4_conv1_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD4_conv1_3x1/relu"
  type: "ReLU"
  bottom: "NBD4_conv1_3x1"
  top: "NBD4_conv1_3x1"
}
layer {
  name: "NBD4_conv1_1x3"
  type: "Convolution"
  bottom: "NBD4_conv1_3x1"
  top: "NBD4_conv1_1x3"
  convolution_param {
    num_output: 64
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD4_conv1_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD4_conv1_1x3"
  top: "NBD4_conv1_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD4_conv1_1x3/scale"
  type: "Scale"
  bottom: "NBD4_conv1_1x3"
  top: "NBD4_conv1_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD4_conv1_1x3/relu"
  type: "ReLU"
  bottom: "NBD4_conv1_1x3"
  top: "NBD4_conv1_1x3"
}
layer {
  name: "NBD4_conv2_3x1"
  type: "Convolution"
  bottom: "NBD4_conv1_1x3"
  top: "NBD4_conv2_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD4_conv2_3x1/relu"
  type: "ReLU"
  bottom: "NBD4_conv2_3x1"
  top: "NBD4_conv2_3x1"
}
layer {
  name: "NBD4_conv2_1x3"
  type: "Convolution"
  bottom: "NBD4_conv2_3x1"
  top: "NBD4_conv2_1x3"
  convolution_param {
    num_output: 64
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD4_conv2_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD4_conv2_1x3"
  top: "NBD4_conv2_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD4_conv2_1x3/scale"
  type: "Scale"
  bottom: "NBD4_conv2_1x3"
  top: "NBD4_conv2_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD4_conv2_1x3/relu"
  type: "ReLU"
  bottom: "NBD4_conv2_1x3"
  top: "NBD4_conv2_1x3"
}
layer {
  name: "NBD4_res"
  type: "Eltwise"
  bottom: "NBD3_res"
  bottom: "NBD4_conv2_1x3"
  top: "NBD4_res"
}
layer {
  name: "NBD4_res/relu"
  type: "ReLU"
  bottom: "NBD4_res"
  top: "NBD4_res"
}
layer {
  name: "NBD5_conv1_3x1"
  type: "Convolution"
  bottom: "NBD4_res"
  top: "NBD5_conv1_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD5_conv1_3x1/relu"
  type: "ReLU"
  bottom: "NBD5_conv1_3x1"
  top: "NBD5_conv1_3x1"
}
layer {
  name: "NBD5_conv1_1x3"
  type: "Convolution"
  bottom: "NBD5_conv1_3x1"
  top: "NBD5_conv1_1x3"
  convolution_param {
    num_output: 64
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD5_conv1_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD5_conv1_1x3"
  top: "NBD5_conv1_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD5_conv1_1x3/scale"
  type: "Scale"
  bottom: "NBD5_conv1_1x3"
  top: "NBD5_conv1_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD5_conv1_1x3/relu"
  type: "ReLU"
  bottom: "NBD5_conv1_1x3"
  top: "NBD5_conv1_1x3"
}
layer {
  name: "NBD5_conv2_3x1"
  type: "Convolution"
  bottom: "NBD5_conv1_1x3"
  top: "NBD5_conv2_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD5_conv2_3x1/relu"
  type: "ReLU"
  bottom: "NBD5_conv2_3x1"
  top: "NBD5_conv2_3x1"
}
layer {
  name: "NBD5_conv2_1x3"
  type: "Convolution"
  bottom: "NBD5_conv2_3x1"
  top: "NBD5_conv2_1x3"
  convolution_param {
    num_output: 64
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD5_conv2_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD5_conv2_1x3"
  top: "NBD5_conv2_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD5_conv2_1x3/scale"
  type: "Scale"
  bottom: "NBD5_conv2_1x3"
  top: "NBD5_conv2_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD5_conv2_1x3/relu"
  type: "ReLU"
  bottom: "NBD5_conv2_1x3"
  top: "NBD5_conv2_1x3"
}
layer {
  name: "NBD5_res"
  type: "Eltwise"
  bottom: "NBD4_res"
  bottom: "NBD5_conv2_1x3"
  top: "NBD5_res"
}
layer {
  name: "NBD5_res/relu"
  type: "ReLU"
  bottom: "NBD5_res"
  top: "NBD5_res"
}
layer {
  name: "DownsamplerBlock6_conv"
  type: "Convolution"
  bottom: "NBD5_res"
  top: "DownsamplerBlock6_conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "DownsamplerBlock6_pool"
  type: "Pooling"
  bottom: "NBD5_res"
  top: "DownsamplerBlock6_pool"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "DownsamplerBlock6_concat"
  type: "Concat"
  bottom: "DownsamplerBlock6_conv"
  bottom: "DownsamplerBlock6_pool"
  top: "DownsamplerBlock6_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "DownsamplerBlock6_concat/bn"
  type: "BatchNorm"
  bottom: "DownsamplerBlock6_concat"
  top: "DownsamplerBlock6_concat"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "DownsamplerBlock6_concat/scale"
  type: "Scale"
  bottom: "DownsamplerBlock6_concat"
  top: "DownsamplerBlock6_concat"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "DownsamplerBlock6_concat/relu"
  type: "ReLU"
  bottom: "DownsamplerBlock6_concat"
  top: "DownsamplerBlock6_concat"
}
layer {
  name: "NBD7_conv1_3x1"
  type: "Convolution"
  bottom: "DownsamplerBlock6_concat"
  top: "NBD7_conv1_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD7_conv1_3x1/relu"
  type: "ReLU"
  bottom: "NBD7_conv1_3x1"
  top: "NBD7_conv1_3x1"
}
layer {
  name: "NBD7_conv1_1x3"
  type: "Convolution"
  bottom: "NBD7_conv1_3x1"
  top: "NBD7_conv1_1x3"
  convolution_param {
    num_output: 128
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD7_conv1_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD7_conv1_1x3"
  top: "NBD7_conv1_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD7_conv1_1x3/scale"
  type: "Scale"
  bottom: "NBD7_conv1_1x3"
  top: "NBD7_conv1_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD7_conv1_1x3/relu"
  type: "ReLU"
  bottom: "NBD7_conv1_1x3"
  top: "NBD7_conv1_1x3"
}
layer {
  name: "NBD7_conv2_3x1"
  type: "Convolution"
  bottom: "NBD7_conv1_1x3"
  top: "NBD7_conv2_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD7_conv2_3x1/relu"
  type: "ReLU"
  bottom: "NBD7_conv2_3x1"
  top: "NBD7_conv2_3x1"
}
layer {
  name: "NBD7_conv2_1x3"
  type: "Convolution"
  bottom: "NBD7_conv2_3x1"
  top: "NBD7_conv2_1x3"
  convolution_param {
    num_output: 128
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD7_conv2_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD7_conv2_1x3"
  top: "NBD7_conv2_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD7_conv2_1x3/scale"
  type: "Scale"
  bottom: "NBD7_conv2_1x3"
  top: "NBD7_conv2_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD7_conv2_1x3/relu"
  type: "ReLU"
  bottom: "NBD7_conv2_1x3"
  top: "NBD7_conv2_1x3"
}
layer {
  name: "NBD7_res"
  type: "Eltwise"
  bottom: "DownsamplerBlock6_concat"
  bottom: "NBD7_conv2_1x3"
  top: "NBD7_res"
}
layer {
  name: "NBD7_res/relu"
  type: "ReLU"
  bottom: "NBD7_res"
  top: "NBD7_res"
}
layer {
  name: "NBD8_conv1_3x1"
  type: "Convolution"
  bottom: "NBD7_res"
  top: "NBD8_conv1_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD8_conv1_3x1/relu"
  type: "ReLU"
  bottom: "NBD8_conv1_3x1"
  top: "NBD8_conv1_3x1"
}
layer {
  name: "NBD8_conv1_1x3"
  type: "Convolution"
  bottom: "NBD8_conv1_3x1"
  top: "NBD8_conv1_1x3"
  convolution_param {
    num_output: 128
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD8_conv1_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD8_conv1_1x3"
  top: "NBD8_conv1_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD8_conv1_1x3/scale"
  type: "Scale"
  bottom: "NBD8_conv1_1x3"
  top: "NBD8_conv1_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD8_conv1_1x3/relu"
  type: "ReLU"
  bottom: "NBD8_conv1_1x3"
  top: "NBD8_conv1_1x3"
}
layer {
  name: "NBD8_conv2_3x1"
  type: "Convolution"
  bottom: "NBD8_conv1_1x3"
  top: "NBD8_conv2_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD8_conv2_3x1/relu"
  type: "ReLU"
  bottom: "NBD8_conv2_3x1"
  top: "NBD8_conv2_3x1"
}
layer {
  name: "NBD8_conv2_1x3"
  type: "Convolution"
  bottom: "NBD8_conv2_3x1"
  top: "NBD8_conv2_1x3"
  convolution_param {
    num_output: 128
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD8_conv2_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD8_conv2_1x3"
  top: "NBD8_conv2_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD8_conv2_1x3/scale"
  type: "Scale"
  bottom: "NBD8_conv2_1x3"
  top: "NBD8_conv2_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD8_conv2_1x3/relu"
  type: "ReLU"
  bottom: "NBD8_conv2_1x3"
  top: "NBD8_conv2_1x3"
}
layer {
  name: "NBD8_res"
  type: "Eltwise"
  bottom: "NBD7_res"
  bottom: "NBD8_conv2_1x3"
  top: "NBD8_res"
}
layer {
  name: "NBD8_res/relu"
  type: "ReLU"
  bottom: "NBD8_res"
  top: "NBD8_res"
}
layer {
  name: "NBD9_conv1_3x1"
  type: "Convolution"
  bottom: "NBD8_res"
  top: "NBD9_conv1_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD9_conv1_3x1/relu"
  type: "ReLU"
  bottom: "NBD9_conv1_3x1"
  top: "NBD9_conv1_3x1"
}
layer {
  name: "NBD9_conv1_1x3"
  type: "Convolution"
  bottom: "NBD9_conv1_3x1"
  top: "NBD9_conv1_1x3"
  convolution_param {
    num_output: 128
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD9_conv1_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD9_conv1_1x3"
  top: "NBD9_conv1_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD9_conv1_1x3/scale"
  type: "Scale"
  bottom: "NBD9_conv1_1x3"
  top: "NBD9_conv1_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD9_conv1_1x3/relu"
  type: "ReLU"
  bottom: "NBD9_conv1_1x3"
  top: "NBD9_conv1_1x3"
}
layer {
  name: "NBD9_conv2_3x1"
  type: "Convolution"
  bottom: "NBD9_conv1_1x3"
  top: "NBD9_conv2_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD9_conv2_3x1/relu"
  type: "ReLU"
  bottom: "NBD9_conv2_3x1"
  top: "NBD9_conv2_3x1"
}
layer {
  name: "NBD9_conv2_1x3"
  type: "Convolution"
  bottom: "NBD9_conv2_3x1"
  top: "NBD9_conv2_1x3"
  convolution_param {
    num_output: 128
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD9_conv2_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD9_conv2_1x3"
  top: "NBD9_conv2_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD9_conv2_1x3/scale"
  type: "Scale"
  bottom: "NBD9_conv2_1x3"
  top: "NBD9_conv2_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD9_conv2_1x3/relu"
  type: "ReLU"
  bottom: "NBD9_conv2_1x3"
  top: "NBD9_conv2_1x3"
}
layer {
  name: "NBD9_res"
  type: "Eltwise"
  bottom: "NBD8_res"
  bottom: "NBD9_conv2_1x3"
  top: "NBD9_res"
}
layer {
  name: "NBD9_res/relu"
  type: "ReLU"
  bottom: "NBD9_res"
  top: "NBD9_res"
}
layer {
  name: "NBD10_conv1_3x1"
  type: "Convolution"
  bottom: "NBD9_res"
  top: "NBD10_conv1_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD10_conv1_3x1/relu"
  type: "ReLU"
  bottom: "NBD10_conv1_3x1"
  top: "NBD10_conv1_3x1"
}
layer {
  name: "NBD10_conv1_1x3"
  type: "Convolution"
  bottom: "NBD10_conv1_3x1"
  top: "NBD10_conv1_1x3"
  convolution_param {
    num_output: 128
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD10_conv1_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD10_conv1_1x3"
  top: "NBD10_conv1_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD10_conv1_1x3/scale"
  type: "Scale"
  bottom: "NBD10_conv1_1x3"
  top: "NBD10_conv1_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD10_conv1_1x3/relu"
  type: "ReLU"
  bottom: "NBD10_conv1_1x3"
  top: "NBD10_conv1_1x3"
}
layer {
  name: "NBD10_conv2_3x1"
  type: "Convolution"
  bottom: "NBD10_conv1_1x3"
  top: "NBD10_conv2_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD10_conv2_3x1/relu"
  type: "ReLU"
  bottom: "NBD10_conv2_3x1"
  top: "NBD10_conv2_3x1"
}
layer {
  name: "NBD10_conv2_1x3"
  type: "Convolution"
  bottom: "NBD10_conv2_3x1"
  top: "NBD10_conv2_1x3"
  convolution_param {
    num_output: 128
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD10_conv2_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD10_conv2_1x3"
  top: "NBD10_conv2_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD10_conv2_1x3/scale"
  type: "Scale"
  bottom: "NBD10_conv2_1x3"
  top: "NBD10_conv2_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD10_conv2_1x3/relu"
  type: "ReLU"
  bottom: "NBD10_conv2_1x3"
  top: "NBD10_conv2_1x3"
}
layer {
  name: "NBD10_res"
  type: "Eltwise"
  bottom: "NBD9_res"
  bottom: "NBD10_conv2_1x3"
  top: "NBD10_res"
}
layer {
  name: "NBD10_res/relu"
  type: "ReLU"
  bottom: "NBD10_res"
  top: "NBD10_res"
}
layer {
  name: "NBD11_conv1_3x1"
  type: "Convolution"
  bottom: "NBD10_res"
  top: "NBD11_conv1_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD11_conv1_3x1/relu"
  type: "ReLU"
  bottom: "NBD11_conv1_3x1"
  top: "NBD11_conv1_3x1"
}
layer {
  name: "NBD11_conv1_1x3"
  type: "Convolution"
  bottom: "NBD11_conv1_3x1"
  top: "NBD11_conv1_1x3"
  convolution_param {
    num_output: 128
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD11_conv1_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD11_conv1_1x3"
  top: "NBD11_conv1_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD11_conv1_1x3/scale"
  type: "Scale"
  bottom: "NBD11_conv1_1x3"
  top: "NBD11_conv1_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD11_conv1_1x3/relu"
  type: "ReLU"
  bottom: "NBD11_conv1_1x3"
  top: "NBD11_conv1_1x3"
}
layer {
  name: "NBD11_conv2_3x1"
  type: "Convolution"
  bottom: "NBD11_conv1_1x3"
  top: "NBD11_conv2_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD11_conv2_3x1/relu"
  type: "ReLU"
  bottom: "NBD11_conv2_3x1"
  top: "NBD11_conv2_3x1"
}
layer {
  name: "NBD11_conv2_1x3"
  type: "Convolution"
  bottom: "NBD11_conv2_3x1"
  top: "NBD11_conv2_1x3"
  convolution_param {
    num_output: 128
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD11_conv2_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD11_conv2_1x3"
  top: "NBD11_conv2_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD11_conv2_1x3/scale"
  type: "Scale"
  bottom: "NBD11_conv2_1x3"
  top: "NBD11_conv2_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD11_conv2_1x3/relu"
  type: "ReLU"
  bottom: "NBD11_conv2_1x3"
  top: "NBD11_conv2_1x3"
}
layer {
  name: "NBD11_res"
  type: "Eltwise"
  bottom: "NBD10_res"
  bottom: "NBD11_conv2_1x3"
  top: "NBD11_res"
}
layer {
  name: "NBD11_res/relu"
  type: "ReLU"
  bottom: "NBD11_res"
  top: "NBD11_res"
}
layer {
  name: "UpsamplerBlock12_deconv"
  type: "Deconvolution"
  bottom: "NBD11_res"
  top: "UpsamplerBlock12_deconv"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 2
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "UpsamplerBlock12_deconv/bn"
  type: "BatchNorm"
  bottom: "UpsamplerBlock12_deconv"
  top: "UpsamplerBlock12_deconv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "UpsamplerBlock12_deconv/scale"
  type: "Scale"
  bottom: "UpsamplerBlock12_deconv"
  top: "UpsamplerBlock12_deconv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "UpsamplerBlock12_deconv/relu"
  type: "ReLU"
  bottom: "UpsamplerBlock12_deconv"
  top: "UpsamplerBlock12_deconv"
}
layer {
  name: "NBD13_conv1_3x1"
  type: "Convolution"
  bottom: "UpsamplerBlock12_deconv"
  top: "NBD13_conv1_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD13_conv1_3x1/relu"
  type: "ReLU"
  bottom: "NBD13_conv1_3x1"
  top: "NBD13_conv1_3x1"
}
layer {
  name: "NBD13_conv1_1x3"
  type: "Convolution"
  bottom: "NBD13_conv1_3x1"
  top: "NBD13_conv1_1x3"
  convolution_param {
    num_output: 64
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD13_conv1_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD13_conv1_1x3"
  top: "NBD13_conv1_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD13_conv1_1x3/scale"
  type: "Scale"
  bottom: "NBD13_conv1_1x3"
  top: "NBD13_conv1_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD13_conv1_1x3/relu"
  type: "ReLU"
  bottom: "NBD13_conv1_1x3"
  top: "NBD13_conv1_1x3"
}
layer {
  name: "NBD13_conv2_3x1"
  type: "Convolution"
  bottom: "NBD13_conv1_1x3"
  top: "NBD13_conv2_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD13_conv2_3x1/relu"
  type: "ReLU"
  bottom: "NBD13_conv2_3x1"
  top: "NBD13_conv2_3x1"
}
layer {
  name: "NBD13_conv2_1x3"
  type: "Convolution"
  bottom: "NBD13_conv2_3x1"
  top: "NBD13_conv2_1x3"
  convolution_param {
    num_output: 64
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD13_conv2_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD13_conv2_1x3"
  top: "NBD13_conv2_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD13_conv2_1x3/scale"
  type: "Scale"
  bottom: "NBD13_conv2_1x3"
  top: "NBD13_conv2_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD13_conv2_1x3/relu"
  type: "ReLU"
  bottom: "NBD13_conv2_1x3"
  top: "NBD13_conv2_1x3"
}
layer {
  name: "NBD13_res"
  type: "Eltwise"
  bottom: "UpsamplerBlock12_deconv"
  bottom: "NBD13_conv2_1x3"
  top: "NBD13_res"
}
layer {
  name: "NBD13_res/relu"
  type: "ReLU"
  bottom: "NBD13_res"
  top: "NBD13_res"
}
layer {
  name: "NBD14_conv1_3x1"
  type: "Convolution"
  bottom: "NBD13_res"
  top: "NBD14_conv1_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD14_conv1_3x1/relu"
  type: "ReLU"
  bottom: "NBD14_conv1_3x1"
  top: "NBD14_conv1_3x1"
}
layer {
  name: "NBD14_conv1_1x3"
  type: "Convolution"
  bottom: "NBD14_conv1_3x1"
  top: "NBD14_conv1_1x3"
  convolution_param {
    num_output: 64
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD14_conv1_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD14_conv1_1x3"
  top: "NBD14_conv1_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD14_conv1_1x3/scale"
  type: "Scale"
  bottom: "NBD14_conv1_1x3"
  top: "NBD14_conv1_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD14_conv1_1x3/relu"
  type: "ReLU"
  bottom: "NBD14_conv1_1x3"
  top: "NBD14_conv1_1x3"
}
layer {
  name: "NBD14_conv2_3x1"
  type: "Convolution"
  bottom: "NBD14_conv1_1x3"
  top: "NBD14_conv2_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD14_conv2_3x1/relu"
  type: "ReLU"
  bottom: "NBD14_conv2_3x1"
  top: "NBD14_conv2_3x1"
}
layer {
  name: "NBD14_conv2_1x3"
  type: "Convolution"
  bottom: "NBD14_conv2_3x1"
  top: "NBD14_conv2_1x3"
  convolution_param {
    num_output: 64
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD14_conv2_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD14_conv2_1x3"
  top: "NBD14_conv2_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD14_conv2_1x3/scale"
  type: "Scale"
  bottom: "NBD14_conv2_1x3"
  top: "NBD14_conv2_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD14_conv2_1x3/relu"
  type: "ReLU"
  bottom: "NBD14_conv2_1x3"
  top: "NBD14_conv2_1x3"
}
layer {
  name: "NBD14_res"
  type: "Eltwise"
  bottom: "NBD13_res"
  bottom: "NBD14_conv2_1x3"
  top: "NBD14_res"
}
layer {
  name: "NBD14_res/relu"
  type: "ReLU"
  bottom: "NBD14_res"
  top: "NBD14_res"
}
layer {
  name: "NBD15_conv1_3x1"
  type: "Convolution"
  bottom: "NBD14_res"
  top: "NBD15_conv1_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD15_conv1_3x1/relu"
  type: "ReLU"
  bottom: "NBD15_conv1_3x1"
  top: "NBD15_conv1_3x1"
}
layer {
  name: "NBD15_conv1_1x3"
  type: "Convolution"
  bottom: "NBD15_conv1_3x1"
  top: "NBD15_conv1_1x3"
  convolution_param {
    num_output: 64
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD15_conv1_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD15_conv1_1x3"
  top: "NBD15_conv1_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD15_conv1_1x3/scale"
  type: "Scale"
  bottom: "NBD15_conv1_1x3"
  top: "NBD15_conv1_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD15_conv1_1x3/relu"
  type: "ReLU"
  bottom: "NBD15_conv1_1x3"
  top: "NBD15_conv1_1x3"
}
layer {
  name: "NBD15_conv2_3x1"
  type: "Convolution"
  bottom: "NBD15_conv1_1x3"
  top: "NBD15_conv2_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD15_conv2_3x1/relu"
  type: "ReLU"
  bottom: "NBD15_conv2_3x1"
  top: "NBD15_conv2_3x1"
}
layer {
  name: "NBD15_conv2_1x3"
  type: "Convolution"
  bottom: "NBD15_conv2_3x1"
  top: "NBD15_conv2_1x3"
  convolution_param {
    num_output: 64
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD15_conv2_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD15_conv2_1x3"
  top: "NBD15_conv2_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD15_conv2_1x3/scale"
  type: "Scale"
  bottom: "NBD15_conv2_1x3"
  top: "NBD15_conv2_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD15_conv2_1x3/relu"
  type: "ReLU"
  bottom: "NBD15_conv2_1x3"
  top: "NBD15_conv2_1x3"
}
layer {
  name: "NBD15_res"
  type: "Eltwise"
  bottom: "NBD14_res"
  bottom: "NBD15_conv2_1x3"
  top: "NBD15_res"
}
layer {
  name: "NBD15_res/relu"
  type: "ReLU"
  bottom: "NBD15_res"
  top: "NBD15_res"
}
layer {
  name: "UpsamplerBlock16_deconv"
  type: "Deconvolution"
  bottom: "NBD15_res"
  top: "UpsamplerBlock16_deconv"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 2
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "UpsamplerBlock16_deconv/bn"
  type: "BatchNorm"
  bottom: "UpsamplerBlock16_deconv"
  top: "UpsamplerBlock16_deconv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "UpsamplerBlock16_deconv/scale"
  type: "Scale"
  bottom: "UpsamplerBlock16_deconv"
  top: "UpsamplerBlock16_deconv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "UpsamplerBlock16_deconv/relu"
  type: "ReLU"
  bottom: "UpsamplerBlock16_deconv"
  top: "UpsamplerBlock16_deconv"
}
layer {
  name: "NBD17_conv1_3x1"
  type: "Convolution"
  bottom: "UpsamplerBlock16_deconv"
  top: "NBD17_conv1_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 16
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD17_conv1_3x1/relu"
  type: "ReLU"
  bottom: "NBD17_conv1_3x1"
  top: "NBD17_conv1_3x1"
}
layer {
  name: "NBD17_conv1_1x3"
  type: "Convolution"
  bottom: "NBD17_conv1_3x1"
  top: "NBD17_conv1_1x3"
  convolution_param {
    num_output: 16
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD17_conv1_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD17_conv1_1x3"
  top: "NBD17_conv1_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD17_conv1_1x3/scale"
  type: "Scale"
  bottom: "NBD17_conv1_1x3"
  top: "NBD17_conv1_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD17_conv1_1x3/relu"
  type: "ReLU"
  bottom: "NBD17_conv1_1x3"
  top: "NBD17_conv1_1x3"
}
layer {
  name: "NBD17_conv2_3x1"
  type: "Convolution"
  bottom: "NBD17_conv1_1x3"
  top: "NBD17_conv2_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 16
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD17_conv2_3x1/relu"
  type: "ReLU"
  bottom: "NBD17_conv2_3x1"
  top: "NBD17_conv2_3x1"
}
layer {
  name: "NBD17_conv2_1x3"
  type: "Convolution"
  bottom: "NBD17_conv2_3x1"
  top: "NBD17_conv2_1x3"
  convolution_param {
    num_output: 16
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD17_conv2_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD17_conv2_1x3"
  top: "NBD17_conv2_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD17_conv2_1x3/scale"
  type: "Scale"
  bottom: "NBD17_conv2_1x3"
  top: "NBD17_conv2_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD17_conv2_1x3/relu"
  type: "ReLU"
  bottom: "NBD17_conv2_1x3"
  top: "NBD17_conv2_1x3"
}
layer {
  name: "NBD17_res"
  type: "Eltwise"
  bottom: "UpsamplerBlock16_deconv"
  bottom: "NBD17_conv2_1x3"
  top: "NBD17_res"
}
layer {
  name: "NBD17_res/relu"
  type: "ReLU"
  bottom: "NBD17_res"
  top: "NBD17_res"
}
layer {
  name: "NBD18_conv1_3x1"
  type: "Convolution"
  bottom: "NBD17_res"
  top: "NBD18_conv1_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 16
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD18_conv1_3x1/relu"
  type: "ReLU"
  bottom: "NBD18_conv1_3x1"
  top: "NBD18_conv1_3x1"
}
layer {
  name: "NBD18_conv1_1x3"
  type: "Convolution"
  bottom: "NBD18_conv1_3x1"
  top: "NBD18_conv1_1x3"
  convolution_param {
    num_output: 16
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD18_conv1_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD18_conv1_1x3"
  top: "NBD18_conv1_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD18_conv1_1x3/scale"
  type: "Scale"
  bottom: "NBD18_conv1_1x3"
  top: "NBD18_conv1_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD18_conv1_1x3/relu"
  type: "ReLU"
  bottom: "NBD18_conv1_1x3"
  top: "NBD18_conv1_1x3"
}
layer {
  name: "NBD18_conv2_3x1"
  type: "Convolution"
  bottom: "NBD18_conv1_1x3"
  top: "NBD18_conv2_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 16
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD18_conv2_3x1/relu"
  type: "ReLU"
  bottom: "NBD18_conv2_3x1"
  top: "NBD18_conv2_3x1"
}
layer {
  name: "NBD18_conv2_1x3"
  type: "Convolution"
  bottom: "NBD18_conv2_3x1"
  top: "NBD18_conv2_1x3"
  convolution_param {
    num_output: 16
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD18_conv2_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD18_conv2_1x3"
  top: "NBD18_conv2_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD18_conv2_1x3/scale"
  type: "Scale"
  bottom: "NBD18_conv2_1x3"
  top: "NBD18_conv2_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD18_conv2_1x3/relu"
  type: "ReLU"
  bottom: "NBD18_conv2_1x3"
  top: "NBD18_conv2_1x3"
}
layer {
  name: "NBD18_res"
  type: "Eltwise"
  bottom: "NBD17_res"
  bottom: "NBD18_conv2_1x3"
  top: "NBD18_res"
}
layer {
  name: "NBD18_res/relu"
  type: "ReLU"
  bottom: "NBD18_res"
  top: "NBD18_res"
}
layer {
  name: "NBD19_conv1_3x1"
  type: "Convolution"
  bottom: "NBD18_res"
  top: "NBD19_conv1_3x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 16
    bias_term: true
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
}
layer {
  name: "NBD19_conv1_3x1/relu"
  type: "ReLU"
  bottom: "NBD19_conv1_3x1"
  top: "NBD19_conv1_3x1"
}
layer {
  name: "NBD19_conv1_1x3"
  type: "Convolution"
  bottom: "NBD19_conv1_3x1"
  top: "NBD19_conv1_1x3"
  convolution_param {
    num_output: 16
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
}
layer {
  name: "NBD19_conv1_1x3/bn"
  type: "BatchNorm"
  bottom: "NBD19_conv1_1x3"
  top: "NBD19_conv1_1x3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "NBD19_conv1_1x3/scale"
  type: "Scale"
  bottom: "NBD19_conv1_1x3"
  top: "NBD19_conv1_1x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "NBD19_conv1_1x3/relu"
  type: "ReLU"
